Hello @marcosuma, @maastha 
here is the state created with version 1.11.1

```
{
  "mode": "managed",
  "type": "mongodbatlas_project_ip_access_list",
  "name": "ip_access",
  "provider": "provider[\"registry.terraform.io/mongodb/mongodbatlas\"]",
  "instances": [
    {
      "index_key": "0",
      "schema_version": 0,
      "attributes": {
        "aws_security_group": "",
        "cidr_block": "xx.xx.196.90/32",
        "comment": "Campus",
        "id": "ZW50cnk=:ODAuODUuMTk2LjkwLzMy-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl",
        "ip_address": "xx.xx.196.90",
        "project_id": "5aa691890bd66b5845af2a0e",
        "timeouts": {
          "delete": null,
          "read": null
        }
      },
      "sensitive_attributes": [],
      "private": "some private info",
      "dependencies": [
        "data.mongodbatlas_project.project"
      ]
    },
    {
      "index_key": "1",
      "schema_version": 0,
      "attributes": {
        "aws_security_group": "",
        "cidr_block": "xx.xx.196.16/28",
        "comment": "Campus",
        "id": "ZW50cnk=:ODAuODUuMTk2LjE2LzI4-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl",
        "ip_address": "",
        "project_id": "5aa691890bd66b5845af2a0e",
        "timeouts": {
          "delete": null,
          "read": null
        }
      },
      "sensitive_attributes": [],
      "private": "some private info",
      "dependencies": [
        "data.mongodbatlas_project.project"
      ]
    },
    {
      "index_key": "2",
      "schema_version": 0,
      "attributes": {
        "aws_security_group": "",
        "cidr_block": "xx.xx.196.32/29",
        "comment": "Campus",
        "id": "ZW50cnk=:ODAuODUuMTk2LjMyLzI5-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl",
        "ip_address": "",
        "project_id": "5aa691890bd66b5845af2a0e",
        "timeouts": {
          "delete": null,
          "read": null
        }
      },
      "sensitive_attributes": [],
      "private": "some private info",
      "dependencies": [
        "data.mongodbatlas_project.project"
      ]
    }
  ]
}
```

and what I get after 
- terraform init
- terraform plan

```
Providers required by configuration:
.
└── provider[registry.terraform.io/mongodb/mongodbatlas] 1.12.2

Providers required by state:

    provider[registry.terraform.io/mongodb/mongodbatlas]

data.mongodbatlas_project.project: Reading...
data.mongodbatlas_project.project: Read complete after 2s [id=5aa691890bd66b5845af2a0e]
mongodbatlas_project_ip_access_list.ip_access["0"]: Refreshing state... [id=ZW50cnk=:ODAuODUuMTk2LjkwLzMy-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl]
mongodbatlas_project_ip_access_list.ip_access["2"]: Refreshing state... [id=ZW50cnk=:ODAuODUuMTk2LjMyLzI5-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl]
mongodbatlas_project_ip_access_list.ip_access["1"]: Refreshing state... [id=ZW50cnk=:ODAuODUuMTk2LjE2LzI4-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # mongodbatlas_project_ip_access_list.ip_access["0"] must be replaced
-/+ resource "mongodbatlas_project_ip_access_list" "ip_access" {
      + aws_security_group = (known after apply) # forces replacement
      ~ id                 = "ZW50cnk=:ODAuODUuMTk2LjkwLzMy-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl" -> (known after apply)
      ~ ip_address         = "xx.xx.196.90" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # mongodbatlas_project_ip_access_list.ip_access["1"] must be replaced
-/+ resource "mongodbatlas_project_ip_access_list" "ip_access" {
      + aws_security_group = (known after apply) # forces replacement
      ~ id                 = "ZW50cnk=:ODAuODUuMTk2LjE2LzI4-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl" -> (known after apply)
      + ip_address         = (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # mongodbatlas_project_ip_access_list.ip_access["2"] must be replaced
-/+ resource "mongodbatlas_project_ip_access_list" "ip_access" {
      + aws_security_group = (known after apply) # forces replacement
      ~ id                 = "ZW50cnk=:ODAuODUuMTk2LjMyLzI5-cHJvamVjdF9pZA==:NWFhNjkxODkwYmQ2NmI1ODQ1YWYyYTBl" -> (known after apply)
      + ip_address         = (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

In your example you use single host cidr "192.168.0.1/32". Can you please retry with something like this 192.168.196.16/28.
 Unfortunately I can't give you the state after because I don't necessarily want to recreate the resources. 
My question is: What value should the `ip_address` property be set to for non-single-host CIDR?